IRP/src/Documents/AdditionalRevenueAllocation/AdditionalRevenueAllocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>AdditionalRevenueAllocation</name>
 <registerRecords>InformationRegister.T6020S_BatchKeysInfo</registerRecords>
 <registerRecords>AccumulationRegister.R6060T_CostOfGoodsSold</registerRecords>
 <registerRecords>AccumulationRegister.T1050T_AccountingQuantities</registerRecords>
 <registerRecords>InformationRegister.T6070S_BatchRevenueAllocationInfo</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R6020B_BatchBalance</registerRecords>
 <registerRecords>AccumulationRegister.R6080T_OtherPeriodsRevenues</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>AllocationMode</name>
  <type>
   <types>EnumRef.AllocationMode</types>
  </type>
 </attributes>
 <attributes>
  <name>AllocationMethod</name>
  <type>
   <types>EnumRef.AllocationMethod</types>
  </type>
 </attributes>
 <tabularSections>
  <name>RevenueList</name>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Basis</name>
   <type>
    <types>DocumentRef.SalesInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AllocationList</name>
  <attributes>
   <name>BasisRowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Document</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RevenueDocuments</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Document</name>
   <type>
    <types>DocumentRef.SalesInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AllocationDocuments</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Document</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AllocationResult</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>BasisRowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueSalesInvoice</name>
   <type>
    <types>DocumentRef.SalesInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueItem</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesInvoice</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R6080T_OtherPeriodsRevenues/R6080T_OtherPeriodsRevenues.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R6080T_OtherPeriodsRevenues</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AmountTax</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DocumentRef.RevenueAccruals</types>
   <types>DocumentRef.SalesInvoice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>OtherPeriodRevenueType</name>
  <type>
   <types>EnumRef.OtherPeriodRevenueType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Documents/AdditionalRevenueAllocation/Forms/FormSelectRevenueRows/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	R6080T_OtherPeriodsRevenues.Basis AS Document,
	|	R6080T_OtherPeriodsRevenues.RowID,
	|	R6080T_OtherPeriodsRevenues.ItemKey,
	|	R6080T_OtherPeriodsRevenues.Currency,
	|	R6080T_OtherPeriodsRevenues.AmountBalance AS Amount
	|FROM
	|	AccumulationRegister.R6080T_OtherPeriodsRevenues.Balance(&BalancePeriod, Company = &Company
	|	AND CurrencyMovementType = &CurrencyMovementType) AS R6080T_OtherPeriodsRevenues
	|TOTALS
	|BY
	|	Document";
	
	Query.SetParameter("Company", Parameters.Company);
	Query.SetParameter("CurrencyMovementType", ChartsOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency);

	BalancePeriod = Undefined;
	If ValueIsFilled(Parameters.Ref) And Parameters.Ref.Posted Then
		BalancePeriod = New Boundary(Parameters.Ref.PointInTime(), BoundaryType.Excluding);
	Else
		BalancePeriod = EndOfDay(Parameters.Date);
	EndIf;
	Query.SetParameter("BalancePeriod", BalancePeriod);
	QueryResult = Query.Execute();
	QuerySelection_Document = QueryResult.Select(QueryResultIteration.ByGroups);
	While QuerySelection_Document.Next() Do
		NewRow_TopLevel = ThisObject.RevenueRowsTree.GetItems().Add();
		NewRow_TopLevel.Level = 1;
		NewRow_TopLevel.Document = QuerySelection_Document.Document;
		QuerySelection_Details = QuerySelection_Document.Select();
		While QuerySelection_Details.Next() Do
			NewRow_SecondLevel = NewRow_TopLevel.GetItems().Add();
			NewRow_SecondLevel.Level = 2;
			FillPropertyValues(NewRow_SecondLevel, QuerySelection_Details);
			If DocAdditionalRevenueAllocationClientServer.FindRowInArrayOfStructures(Parameters.SelectedRows, "RowID, Basis", 
				QuerySelection_Details.RowID, QuerySelection_Details.Document) <> Undefined Then
				NewRow_SecondLevel.Use = True;
			EndIf;
		EndDo;
	EndDo;
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	AttachIdleHandler("ExpandAllTrees", 1, True);
EndProcedure

&AtClient
Procedure ExpandAllTrees() Export
	RowIDInfoClient.ExpandTree(Items.RevenueRowsTree, ThisObject.RevenueRowsTree.GetItems());
EndProcedure

&AtClient
Procedure Ok(Command)
	Result = New Structure("SelectedRows", New Array());
	For Each Row_TopLevel In ThisObject.RevenueRowsTree.GetItems() Do
		For Each Row_SecondLevel In Row_TopLevel.GetItems() Do
			If Not Row_SecondLevel.Use Then
				Continue;
			EndIf;
			SelectedRow = New Structure();
			SelectedRow.Insert("RowID"    , Row_SecondLevel.RowID);
			SelectedRow.Insert("Basis"    , Row_TopLevel.Document);
			SelectedRow.Insert("ItemKey"  , Row_SecondLevel.ItemKey);
			SelectedRow.Insert("Currency" , Row_SecondLevel.Currency);
			SelectedRow.Insert("Amount"   , Row_SecondLevel.Amount);
			Result.SelectedRows.Add(SelectedRow);
		EndDo;
	EndDo;
	Close(Result);
EndProcedure

&AtClient
Procedure Cancel(Command)
	Close(Undefined);	
EndProcedure

&AtClient
Procedure RevenueRowsTreeBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure RevenueRowsTreeBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure ShowRowKey(Command)
	DocumentsClient.ShowRowKey(ThisObject);
EndProcedure
